
INSERT INTO product (product_name, product_price, create_date, update_date) VALUES
('햄버거빵', 500,NOW(), NOW()),
('소고기패티', 1200,NOW(), NOW()),
('불고기패티', 1000,NOW(), NOW()),
('치즈', 300,NOW(), NOW()),
('양상추', 200,NOW(), NOW()),
('토마토', 300,NOW(), NOW()),
('피클', 100,NOW(), NOW()),
('베이컨', 500,NOW(), NOW()),
('새우패티', 1300,NOW(), NOW()),
('치킨패티', 1100,NOW(), NOW()),
('양파', 150,NOW(), NOW()),
('스파이시소스', 200,NOW(), NOW());

INSERT INTO productLog
(productLog_no, product_id, product_qty, product_condition, productLog_price, customerLog_day, create_date, update_date)
VALUES
(1, 1, 200, '발주', 20000, 1, NOW(), NOW()),
(2, 2, -100, '사용', 0, 1, NOW(), NOW()),
(3, 3, 100, '발주', 30000, 1 ,NOW(), NOW()),
(4, 5, 150, '발주', 75000, 1,NOW(), NOW()),
(5, 7, 50, '발주', 25000, 2,NOW(), NOW()),
(6, 8, -30, '사용', 0, 2,NOW(), NOW()),
(7, 9, -100, '사용', 0, 2,NOW(), NOW()),
(8, 10, 80, '발주', 12000, 2,NOW(), NOW()),
(9, 4, 40, '사용', 0, 3,NOW(), NOW()),
(10, 6, 120, '발주', 60000, 3,NOW(), NOW());


INSERT INTO menu (menu_name, menu_price, create_date, update_date) VALUES
('치즈버거', 5000,NOW(), NOW()),
('불고기버거', 5500,NOW(), NOW()),
('더블불고기버거', 7500,NOW(), NOW()),
('새우버거', 6000,NOW(), NOW()),
('베이컨치즈버거', 7000,NOW(), NOW()),
('클래식버거', 6500,NOW(), NOW()),
('더블치즈버거', 8000,NOW(), NOW()),
('스파이시버거', 7000,NOW(), NOW()),
('치킨버거', 6500,NOW(), NOW()),
('프리미엄버거', 10000,NOW(), NOW());

INSERT INTO recipe (menu_no, product_no, recipe_order) VALUES
(1, 1, 1),
(1, 4, 2),
(1, 2, 3),
(1, 5, 4),
(1, 1, 5),

(2, 1, 1),
(2, 3, 2),
(2, 11, 3),
(2, 5, 4),
(2, 1, 5),

(3, 1, 1),
(3, 3, 2),
(3, 4, 3),
(3, 3, 4),
(3, 11, 5),
(3, 5, 6),
(3, 7, 7),
(3, 1, 8),

(4, 1, 1),
(4, 5, 2),
(4, 9, 3),
(4, 7, 4),
(4, 1, 5),

(5, 1, 1),
(5, 8, 2),
(5, 4, 3),
(5, 2, 4),
(5, 6, 5),
(5, 5, 6),
(5, 1, 7),

(6, 1, 1),
(6, 5, 2),
(6, 6, 3),
(6, 7, 4),
(6, 11, 5),
(6, 2, 6),
(6, 1, 7),

(7, 1, 1),
(7, 4, 2),
(7, 2, 3),
(7, 4, 4),
(7, 2, 5),
(7, 5, 6),
(7, 7, 7),
(7, 1, 8),

(8, 1, 1),
(8, 12, 2),
(8, 10, 3),
(8, 11, 4),
(8, 5, 5),
(8, 12, 6),
(8, 1, 7),

(9, 1, 1),
(9, 5, 2),
(9, 10, 3),
(9, 6, 4),
(9, 7, 5),
(9, 1, 6),

(10, 1, 1),
(10, 4, 2),
(10, 2, 3),
(10, 8, 4),
(10, 4, 5),
(10, 2, 6),
(10, 6, 7),
(10, 11, 8),
(10, 5, 9),
(10, 7, 10),
(10, 1, 11);

